       SKIP1
       SKIP2
       SKIP3
       EJECT
       01  ::-TABLE.
           05  ::-KEY.
               10  ::-KEY1             PIC 999     COMP-3.
               10  ::-KEY2             PIC 99      COMP-3.
               10  ::-KEY3             PIC X(5).

